@extends('layout')

@section('content')
    <div class="container py-5">
        <div class="row flex-lg-row-reverse align-items-center g-5 py-5">
            <div class="col-10 col-sm-8 col-lg-6">
                <img src="/img/sign.svg" class="d-block mx-lg-auto img-fluid" alt="Bootstrap Themes" width="700"
                     height="500" loading="lazy">
            </div>
            <div class="col-lg-6">
                <span class="text-primary mb-3 d-block text-uppercase fw-semibold ls-xl">Одна платформа, множество вариантов</span>
                <h1 class="display-5 fw-bold mb-4">Всё что нужно для достижения цели.</h1>
                <p class="pe-5">
                    «Из коробки» Laravel предлагает элегантные решения для общих функций, необходимых всем современным
                    веб-приложениям. Пришло время начать создавать потрясающие приложения и перестать тратить время на
                    поиск пакетов и изобретать велосипед
                </p>
            </div>
        </div>
    </div>



    <div class="container py-5">

        <div class="row g-5 justify-content-center align-items-start position-relative mb-5">
            <div class="col-xl-4 position-sticky top-0 py-3">
                <div class="mb-4">
                    <svg width="56" class="border border-danger" height="56" viewBox="0 0 56 56" fill="none"
                         xmlns="http://www.w3.org/2000/svg">
                        <rect width="56" height="56" rx="6" fill="#dc35450"></rect>
                        <path
                            d="M20 35.5C20 34.837 20.2634 34.2011 20.7322 33.7322C21.2011 33.2634 21.837 33 22.5 33H36"
                            stroke="#dc3545" stroke-width="2" stroke-linecap="round" stroke-linejoin="round"></path>
                        <path
                            d="M22.5 18H36V38H22.5C21.837 38 21.2011 37.7366 20.7322 37.2678C20.2634 36.7989 20 36.163 20 35.5V20.5C20 19.837 20.2634 19.2011 20.7322 18.7322C21.2011 18.2634 21.837 18 22.5 18V18Z"
                            stroke="#dc3545" stroke-width="2" stroke-linecap="round" stroke-linejoin="round"></path>
                    </svg>
                </div>
                <h5 class="fs-4 mt-2  fw-semibold">Routing</h5>
                <p class="mb-0">Элегантная и эффективная система роутинга для реализации любых адресов в
                                приложении.</p>
            </div>
            <div class="col-xl-8 text-center text-xl-start">
                    <div class="bg-white p-5 rounded-5 shadow">

                        <p>
                            Аутентифицировать пользователей так же просто, как добавить промежуточное программное
                            обеспечение аутентификации в определение маршрута Laravel:
                        </p>

                        <p>
                            Аутентифицировать пользователей так же просто, как добавить промежуточное программное
                            обеспечение аутентификации в определение маршрута Laravel:
                        </p>
                        <p>
                            Аутентифицировать пользователей так же просто, как добавить промежуточное программное
                            обеспечение аутентификации в определение маршрута Laravel:
                        </p>
                        <p>
                            Аутентифицировать пользователей так же просто, как добавить промежуточное программное
                            обеспечение аутентификации в определение маршрута Laravel:
                        </p>
                        <p>
                            Аутентифицировать пользователей так же просто, как добавить промежуточное программное
                            обеспечение аутентификации в определение маршрута Laravel:
                        </p>
                        <p>
                            Аутентифицировать пользователей так же просто, как добавить промежуточное программное
                            обеспечение аутентификации в определение маршрута Laravel:
                        </p>
                        <p>
                            Аутентифицировать пользователей так же просто, как добавить промежуточное программное
                            обеспечение аутентификации в определение маршрута Laravel:
                        </p>
                        <p>
                            Аутентифицировать пользователей так же просто, как добавить промежуточное программное
                            обеспечение аутентификации в определение маршрута Laravel:
                        </p>       <p>
                            Аутентифицировать пользователей так же просто, как добавить промежуточное программное
                            обеспечение аутентификации в определение маршрута Laravel:
                        </p>
                        <p>
                            Аутентифицировать пользователей так же просто, как добавить промежуточное программное
                            обеспечение аутентификации в определение маршрута Laravel:
                        </p>
                        <p>
                            Аутентифицировать пользователей так же просто, как добавить промежуточное программное
                            обеспечение аутентификации в определение маршрута Laravel:
                        </p>
                        <p>
                            Аутентифицировать пользователей так же просто, как добавить промежуточное программное
                            обеспечение аутентификации в определение маршрута Laravel:
                        </p>
                        <p>
                            Аутентифицировать пользователей так же просто, как добавить промежуточное программное
                            обеспечение аутентификации в определение маршрута Laravel:
                        </p>
                        <p>
                            Аутентифицировать пользователей так же просто, как добавить промежуточное программное
                            обеспечение аутентификации в определение маршрута Laravel:
                        </p>

                    </div>
            </div>
        </div>

        <div class="row g-5 justify-content-center align-items-start position-relative mb-5">
            <div class="col-xl-4 position-sticky top-0 py-3">
                <div class="mb-4">
                    <svg width="56" class="border border-danger" height="56" viewBox="0 0 56 56" fill="none"
                         xmlns="http://www.w3.org/2000/svg">
                        <rect width="56" height="56" rx="6" fill="#dc35450"></rect>
                        <path
                            d="M20 35.5C20 34.837 20.2634 34.2011 20.7322 33.7322C21.2011 33.2634 21.837 33 22.5 33H36"
                            stroke="#dc3545" stroke-width="2" stroke-linecap="round" stroke-linejoin="round"></path>
                        <path
                            d="M22.5 18H36V38H22.5C21.837 38 21.2011 37.7366 20.7322 37.2678C20.2634 36.7989 20 36.163 20 35.5V20.5C20 19.837 20.2634 19.2011 20.7322 18.7322C21.2011 18.2634 21.837 18 22.5 18V18Z"
                            stroke="#dc3545" stroke-width="2" stroke-linecap="round" stroke-linejoin="round"></path>
                    </svg>
                </div>
                <h5 class="fs-4 mt-2  fw-semibold">Routing</h5>
                <p class="mb-0">Элегантная и эффективная система роутинга для реализации любых адресов в
                                приложении.</p>
            </div>

            <div class="col-xl-8 text-center text-xl-start">
                <div class="bg-white p-5 rounded-5 shadow">

                    <p>
                        Аутентифицировать пользователей так же просто, как добавить промежуточное программное
                        обеспечение аутентификации в определение маршрута Laravel:
                    </p>

                    <p>
                        Аутентифицировать пользователей так же просто, как добавить промежуточное программное
                        обеспечение аутентификации в определение маршрута Laravel:
                    </p>
                    <p>
                        Аутентифицировать пользователей так же просто, как добавить промежуточное программное
                        обеспечение аутентификации в определение маршрута Laravel:
                    </p>
                    <p>
                        Аутентифицировать пользователей так же просто, как добавить промежуточное программное
                        обеспечение аутентификации в определение маршрута Laravel:
                    </p>
                    <p>
                        Аутентифицировать пользователей так же просто, как добавить промежуточное программное
                        обеспечение аутентификации в определение маршрута Laravel:
                    </p>
                    <p>
                        Аутентифицировать пользователей так же просто, как добавить промежуточное программное
                        обеспечение аутентификации в определение маршрута Laravel:
                    </p>
                    <p>
                        Аутентифицировать пользователей так же просто, как добавить промежуточное программное
                        обеспечение аутентификации в определение маршрута Laravel:
                    </p>
                    <p>
                        Аутентифицировать пользователей так же просто, как добавить промежуточное программное
                        обеспечение аутентификации в определение маршрута Laravel:
                    </p>       <p>
                        Аутентифицировать пользователей так же просто, как добавить промежуточное программное
                        обеспечение аутентификации в определение маршрута Laravel:
                    </p>
                    <p>
                        Аутентифицировать пользователей так же просто, как добавить промежуточное программное
                        обеспечение аутентификации в определение маршрута Laravel:
                    </p>
                    <p>
                        Аутентифицировать пользователей так же просто, как добавить промежуточное программное
                        обеспечение аутентификации в определение маршрута Laravel:
                    </p>
                    <p>
                        Аутентифицировать пользователей так же просто, как добавить промежуточное программное
                        обеспечение аутентификации в определение маршрута Laravel:
                    </p>
                    <p>
                        Аутентифицировать пользователей так же просто, как добавить промежуточное программное
                        обеспечение аутентификации в определение маршрута Laravel:
                    </p>
                    <p>
                        Аутентифицировать пользователей так же просто, как добавить промежуточное программное
                        обеспечение аутентификации в определение маршрута Laravel:
                    </p>

                </div>
            </div>
        </div>

        <div class="row g-5 justify-content-center align-items-start position-relative mb-5">
            <div class="col-xl-4 position-sticky top-0 py-3">
                <div class="mb-4">
                    <svg width="56" class="border border-danger" height="56" viewBox="0 0 56 56" fill="none"
                         xmlns="http://www.w3.org/2000/svg">
                        <rect width="56" height="56" rx="6" fill="#dc35450"></rect>
                        <path
                            d="M20 35.5C20 34.837 20.2634 34.2011 20.7322 33.7322C21.2011 33.2634 21.837 33 22.5 33H36"
                            stroke="#dc3545" stroke-width="2" stroke-linecap="round" stroke-linejoin="round"></path>
                        <path
                            d="M22.5 18H36V38H22.5C21.837 38 21.2011 37.7366 20.7322 37.2678C20.2634 36.7989 20 36.163 20 35.5V20.5C20 19.837 20.2634 19.2011 20.7322 18.7322C21.2011 18.2634 21.837 18 22.5 18V18Z"
                            stroke="#dc3545" stroke-width="2" stroke-linecap="round" stroke-linejoin="round"></path>
                    </svg>
                </div>
                <h5 class="fs-4 mt-2  fw-semibold">Routing</h5>
                <p class="mb-0">Элегантная и эффективная система роутинга для реализации любых адресов в
                                приложении.</p>
            </div>

            <div class="col-xl-8 text-center text-xl-start">
                <div class="bg-white p-5 rounded-5 shadow">

                    <p>
                        Аутентифицировать пользователей так же просто, как добавить промежуточное программное
                        обеспечение аутентификации в определение маршрута Laravel:
                    </p>

                    <p>
                        Аутентифицировать пользователей так же просто, как добавить промежуточное программное
                        обеспечение аутентификации в определение маршрута Laravel:
                    </p>
                    <p>
                        Аутентифицировать пользователей так же просто, как добавить промежуточное программное
                        обеспечение аутентификации в определение маршрута Laravel:
                    </p>
                    <p>
                        Аутентифицировать пользователей так же просто, как добавить промежуточное программное
                        обеспечение аутентификации в определение маршрута Laravel:
                    </p>
                    <p>
                        Аутентифицировать пользователей так же просто, как добавить промежуточное программное
                        обеспечение аутентификации в определение маршрута Laravel:
                    </p>
                    <p>
                        Аутентифицировать пользователей так же просто, как добавить промежуточное программное
                        обеспечение аутентификации в определение маршрута Laravel:
                    </p>
                    <p>
                        Аутентифицировать пользователей так же просто, как добавить промежуточное программное
                        обеспечение аутентификации в определение маршрута Laravel:
                    </p>
                    <p>
                        Аутентифицировать пользователей так же просто, как добавить промежуточное программное
                        обеспечение аутентификации в определение маршрута Laravel:
                    </p>       <p>
                        Аутентифицировать пользователей так же просто, как добавить промежуточное программное
                        обеспечение аутентификации в определение маршрута Laravel:
                    </p>
                    <p>
                        Аутентифицировать пользователей так же просто, как добавить промежуточное программное
                        обеспечение аутентификации в определение маршрута Laravel:
                    </p>
                    <p>
                        Аутентифицировать пользователей так же просто, как добавить промежуточное программное
                        обеспечение аутентификации в определение маршрута Laravel:
                    </p>
                    <p>
                        Аутентифицировать пользователей так же просто, как добавить промежуточное программное
                        обеспечение аутентификации в определение маршрута Laravel:
                    </p>
                    <p>
                        Аутентифицировать пользователей так же просто, как добавить промежуточное программное
                        обеспечение аутентификации в определение маршрута Laravel:
                    </p>
                    <p>
                        Аутентифицировать пользователей так же просто, как добавить промежуточное программное
                        обеспечение аутентификации в определение маршрута Laravel:
                    </p>

                </div>
            </div>
        </div>


        <div class="p-5 mt-5 bg-body-secondary rounded-4 d-flex align-items-center justify-content-between">
            <div class="col-7">
                <p class="display-6 fw-bold">Мы лишь прикоснулись к поверхности.</p>
                <p class="mb-0">
                    В Laravel есть все необходимое для создания веб-приложения, включая проверку электронной почты, ограничение скорости и пользовательские консольные команды.
                </p>
            </div>

            <a href="#" class="btn btn-outline-primary btn-lg px-4">
                Прочтите документацию
            </a>
        </div>
    </div>
@endsection



